# ==========================================
# Stage 1: Builder (Сборка приложения и извлечение слоев) # СУПЕР ВАЖНО ЗАПОМНИТЬ, ЧТО ПОРЯДОК СТРОК В DOCKER FILE НЕВЕРОЯТНО ВАЖЕН, Т.К. ИНВАЛИДАЦИЯ КЭША ВЕРХНЕГО СЛОЯ АВТОМАТОМ УБИВАЕТ КЭШ НИЖНЕГО ВНУТРИ ОДНОГО STAGE
# ==========================================
FROM eclipse-temurin:21-jdk-alpine AS builder

# Устанавливаем рабочую директорию. Работает по типу cd /build. Т.е. все следующие команды будут выполняться относительно нее
WORKDIR /build

# Шаг 1: Копируем только файлы Gradle для кэширования зависимостей.
# Это экономит массу времени, так как зависимости не будут скачиваться заново,
# если build.gradle не изменился.
# COPY директория_в_проекте_где_docker_file диреткория_в_контейнере(т.е. директория build)
# Причем важно, что мы не просто скопировали все COPY . .(куда вошли бы в том числе исходники, а зависимости
# скопировали отдельно - это отдельные слои кэша, а исходники отдельно. И т.к. зависимости меняются редко, то
# они просто возьмутся из кэша docker и не будут по новой скачиваться. А вот исходиники меняются часто и они уже будут
# инвалидировать кэш
COPY gradlew .
COPY gradle gradle
COPY build.gradle.kts settings.gradle.kts ./

# Даем права на исполнение wrapper'у
RUN chmod +x ./gradlew

# Скачиваем зависимости (кэшируется Docker'ом) --no-daemon - чтобы gradle не создавал daemon поток, который постоянно живет и хранит в себе в памяти
# Классы gradle для ускорения сборки. Т.к. в docker мы делаем разово сборку и на мне нужно держать такой поток, то указываем --no-daemon
RUN ./gradlew dependencies --no-daemon

# Шаг 2: Копируем исходный код. Намеренно отделили исходники, чтобы они не инвалидировали кэш с зависимостями
COPY src src

# Собираем приложение. Используем bootJar, который НЕ запускает тесты, т.к. сборка docker образа - это финальный этам CI
# Тесты должны были быть пройдены на более раннем этапе в сборке. И благодаря bootJar комплириуются и упаковываются исходники + зависимости
# Т.е. благодаря этой команде мы получаем в /build/libs директории наш fat jar с приложухой и после этого командой
# java -jar мы сможем запустить наше приложение
# Причем кэш слоя, а слой(это каждая отдельная команда в docker файле) здесь уже не отрабатыает, поскольку
# На прошлом шаге src не совпадет(если мы реально что-то поменяли)
RUN ./gradlew clean bootJar --no-daemon

# Шаг 3: Распаковываем Fat JAR на слои (Best Practice для Spring Boot 3.3+)
# Это нужно так же для кэширования. Если бы мы просто передавали наш far jar без распаковки, то изменения
# src влияло бы на хэш всего app.jar, а значит, что кэш бы не отрабатывал для зависимостей и пришлос бы
# по новой отправлять в registry весь app.jar с зависимостями, хотя на самом деле они не изменялись и можно было
# взять и из кэша
RUN java -Djarmode=tools -jar build/libs/*.jar extract --layers --destination extracted


# ==========================================
# Stage 2: Runtime (Финальный минимальный образ). Т.к. это отдельная stage, то ее кэш автоматом не инвалидируется, несмотря на то, что она идет ниже, т.к. это stage между собой независимы
# ==========================================
FROM eclipse-temurin:21-jre-alpine

# Добавляем timezone и curl для healthcheck'ов (если нужно)
RUN apk add --no-cache tzdata curl

# Устанавливаем рабочую директорию
WORKDIR /app

# Создаем непривилегированного пользователя и группу для безопасности, т.к. по умолчанию docker запускает контейнер как root и ему становятя доступны все права
# Если наше приложение будет с уязвимостями, то через root можно будет выбраться наружу из контейнера
# Поэтому мы создаем отдельного пользователя и группу без прав
RUN addgroup -S spring && adduser -S spring -G spring

# Копируем слои из Stage 1 в строгом порядке!
# Порядок важен: редко изменяемые слои идут первыми, часто изменяемые (наш код) - последними.
# Это позволяет Docker использовать кэш слоев максимально эффективно.
# Т.к. copy так же исполняется от root, то скопированный файлы будут принадлежать root
# А мы хотим, чтобы наш spring пользоавтель мог читать файлы, поэтому у скопированных файлов меняем
# ownera на spring - это и делаем команда --chown
COPY --from=builder --chown=spring:spring /build/extracted/dependencies/ ./
COPY --from=builder --chown=spring:spring /build/extracted/snapshot-dependencies/ ./
COPY --from=builder --chown=spring:spring /build/extracted/application/ ./

# Переключаемся на непривилегированного пользователя
USER spring:spring

# Прокидываем стандартный порт
EXPOSE 8080

# Переменные окружения для настройки JVM в контейнере
# Spring Boot 3 отлично работает с контейнерами "из коробки", но мы задаем лимиты RAM
ENV JAVA_OPTS="-XX:InitialRAMPercentage=50.0 -XX:MaxRAMPercentage=80.0 -XX:+UseZGC -XX:+ZGenerational"

# Запуск. Под капотом он возьмет JarLauncher(это точка входа в наш проект) и будет запущен thin.jar + libs из extracted/dependencies
ENTRYPOINT ["sh", "-c", "java $JAVA_OPTS -jar *.jar"]